xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_LT2252W_AD_CMI_M220ZGE.h
//==================================================================
// Definitions of _VGA_CHROMA_PATTERN12_SUPPORT
//==================================================================
#define _VGA_CHROMA_PATTERN12_SUPPORT                           _ON

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   0x78
#define _CT7200_LenovoPrj_GREEN                                 0x78
#define _CT7200_LenovoPrj_BLUE                                  0x80

#define _CTSRGB_LenovoPrj_RED                                   0x80
#define _CTSRGB_LenovoPrj_GREEN                                 0x80
#define _CTSRGB_LenovoPrj_BLUE                                  0x80

#define _CT6500_LenovoPrj_RED                                   0x80
#define _CT6500_LenovoPrj_GREEN                                 0x80
#define _CT6500_LenovoPrj_BLUE                                  0x80

#define _CT9300_LenovoPrj_RED                                   0x72
#define _CT9300_LenovoPrj_GREEN                                 0x72
#define _CT9300_LenovoPrj_BLUE                                  0x80

#define _CTUSER_LenovoPrj_RED                                   0x80
#define _CTUSER_LenovoPrj_GREEN                                 0x80
#define _CTUSER_LenovoPrj_BLUE                                  0x80

//-------------------------------------------------
//define Audio
//-------------------------------------------------
#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF
#define _ANALOG_VOLUME_MUTE										0x0000

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#define _OSD_POSITION_FONT_A_H_DELAY_                           0

//==================================================================
// Panel VCOM Function
//==================================================================
#define _PANEL_VCOM_ADJUST_FUNCTION						        _OFF

//-------------------------------------------------
//Definitions for panel backlight PWM ferq.
//-------------------------------------------------
#define _PWMFREQIVF                                             0
#define _PWMFREQ20K                                             1

#define _BACKLIGHT_PWM_FREQ_SELECT                              _PWMFREQIVF

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------

#endif // End of #if(_PROJECT == _RL6096_PROJECT)

